## Import Modules

modul yang kita import ada 2 antara lain :

1. pandas
2. numpy

In [1]:
import pandas as pd
import numpy as np

Setelah itu sebaiknya kita mengecek terlebih dahulu versi pandas dan numpy yang kita gunakan saat ini, bertujuan agar apabila terjadi perbedaan output atau tampilan itu kemungkinan besar di sebabkan oleh perbedaan versi yang di gunakan.

In [2]:
print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

## Persiapan Data Frame

-membuat variabel n_rows yang menandakan jumlah baris

-membuat variabel n_cols yang menandakan jumlah kolom

-dan memanfaatkan tuple yang dikenakan terhadap String

-contoh : String 'LAMPU' yang dikenakan tuple akan menghasilkan tuple seperti ini 'L','A','M', 'P', 'U'.

-np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols) artinya data frame akan diisi dengan bilangan integer dengan jangkauan 1 sampai 20 (1,2,3,4,5,6,7,8,9, dst...) yang muncul secara random. Kemudian, untuk banyak data yang ditampilkan itu ditentukan oleh n_rows dan n_cols.

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('LAMPU')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)
df.head()

    L   A   M   P   U
0   6  12  16   4  10
1   8   2   8  19  18
2  15   7   7  19   4
3   4   4   4  15  16
4  18   2  16  11  14

-Kita akan bagi data frame di atas menjadi 2 bagian 

-Dan kita akan menghapus baris index 1 dan index ke 4

-Dan kita juga membuat data frame yang cuma berisi baris index 1, 2, 4

In [5]:
df1 = df.copy(deep=True)
df1 = df1.drop([1, 4])
df1

    L   A   M   P   U
0   6  12  16   4  10
2  15   7   7  19   4
3   4   4   4  15  16

In [7]:
df2 = df.copy(deep=True)
df2 = df2.drop([0, 3])
df2

    L  A   M   P   U
1   8  2   8  19  18
2  15  7   7  19   4
4  18  2  16  11  14

## Menggabungkan dua Data Frame

-Setelah kita membagi data frame nya kita akan menggabungkan kan kembali data frame tersebut yang memiliki nilai sama dengan menggunakan fungsi pd.merge

-Terdapat 2 cara yang akan kita lakukan :
1. inner
2. outer (menghilangkan angka pada baris yang mengadopsi duplikasi)

In [8]:
df_inner = pd.merge(df1, df2, how='inner')
df_inner

    L  A  M   P  U
0  15  7  7  19  4

In [9]:
df_outer = pd.merge(df1, df2, how='outer')
df_outer

    L   A   M   P   U
0   6  12  16   4  10
1  15   7   7  19   4
2   4   4   4  15  16
3   8   2   8  19  18
4  18   2  16  11  14